/*********************************************************************************************************
 * Copyright (C) 2024 EternalChip, Inc. (Gmbh) 或其附属公司.
 *
 * 版权所有.
 *
 * @file gpio.h
 *
 * @par 依赖
 *
 * - gpio.c
 *
 * @author Jack | R&D 部门 | EternalChip 立芯嵌入式
 *
 * @brief 芯片区读写相关函数(GPIO 模块底层配置).
 *
 * 处理流程:
 *
 * 直接调用.
 *
 * @version V1.0 2024-09-13
 *
 * @note 1 tab == 4 个空格!
 *
 * ********************************************************************************************************/

/* 防止重复包含 ------------------------------------------------------------------------------------*/
#ifndef __GPIO_H
#define __GPIO_H

#ifndef LED_C13_PORT
#define LED_C13_PORT GPIOC
#endif
#ifndef LED_C13_PIN
#define LED_C13_PIN  GPIO_Pin_13
#endif

/* 头文件 --------------------------------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include "main.h"
//#include "System.h"

/* 导出类型 ------------------------------------------------------------------------------------------*/
/* 导出常量 ------------------------------------------------------------------------------------------*/
/* 导出宏 --------------------------------------------------------------------------------------------*/
#define LED_OFF    GPIO_SetBits(LED_C13_PORT,LED_C13_PIN);
#define LED_ON     GPIO_ResetBits(LED_C13_PORT,LED_C13_PIN);

/* 导出函数 ------------------------------------------------------------------------------------------*/

extern void      GPIO_Config (void);
extern void      Key_IO_Init (void);
extern uint8_t   Key_Scan    (void);
extern void      Led_IO_Init (void);
extern void      Breathing_light (void);

#endif /* __GPIO_H */
